project_backend/app/controllers/games_controller.rb

    def create
        game = Game.create
        user1 = User.find_by(name:params["user1"])
        user2 = User.find_by(name:params["user2"])
        Session.create(game_id:game.id, user_id: user1.id)
        Session.create(game_id:game.id, user_id: user2.id)
---
INSERT INTO "games" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-01-27 15:39:19.706874"], ["updated_at", "2021-01-27 15:39:19.706874"]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "a"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "b"], ["LIMIT", 1]]
INSERT INTO "games" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-01-29 18:25:35.861559"], ["updated_at", "2021-01-29 18:25:35.861559"]]

    def update
        Game.find(params[:id]).update(winner: game_params["winner"])
        render json: Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 180], ["LIMIT", 1]]
UPDATE "games" SET "winner" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["winner", "a"], ["updated_at", "2021-01-28 03:57:29.244538"], ["id", 190]]
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 179], ["LIMIT", 1]]