project_backend/app/controllers/sessions_controller.rb

    def index
        sessions_with_scores = Session.all.select{|s|s.score != nil}
        top5 = sessions_with_scores.sort_by{|s| s.score}.reverse[0..4]
        data = {}
        top5.each{|s| data[s.user.name] = s.score}
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]