project_backend/app/controllers/sessions_controller.rb

    def score
        byebug
        user_id = User.all.find_by(name: params['id']).id
        session = Session.find_by(user_id: user_id, game_id: session_params['game_id'])
        session.update(session_params['score'])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "b"], ["LIMIT", 1]]
UPDATE "games" SET "winner" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["winner", "b"], ["updated_at", "2021-01-29 00:05:43.606033"], ["id", 78]]