project_backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "dana"], ["created_at", "2021-01-26 04:11:04.198591"], ["updated_at", "2021-01-26 04:11:04.198591"]]
---
    def create
        render json: User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Mark"], ["LIMIT", 1]]
---
    def login
        user = User.all.find_by(name: params["username"])