project_backend/app/controllers/words_controller.rb

    def show
        words = Word.all.select{|word|word.difficulty == (params["id"].to_i)}
---
SELECT "words".* FROM "words"